
public class Main {
    public static void main(String[] args) {
        Unit unit1 = new Unit(100, "Petya");
          unit1.printInfo();
           System.out.println("================");
             Mage mage1 = new Mage(80, "Vanya", 50);

                mage1.printInfo();

    }
}
//1) класс - это шаблон ,а обьект - это модель сделанная по шаблону

//2) Инкапсуляция - это защищенные поля и методы  с целью исключения влияния на окружающее

//3) Наследование - это механизм, который позволяет классу наследовать свойства и методы другого класса

//4)Полиморфизм - этоонятие из объектно-ориентированного программирования, которое позволяет разным обЪектам выполнять одинаковые действия

//5) public,private,deffault

// нужны для ограничения доступа к полям
